11/data/attachments/3a8f27b0b65e8639.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Cynthia_provide_Friend_50048_6</nif:username>
            <nif:friendToBeRequested>soap_friends_a26ceda9-9baa-495d-b3b3-74a127cc4d09</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>